Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Returns the result of combining the elements of the sequence using the given closure.
ja: シーケンスの要素を与えられたクロージャを使って結合する結果を返します。

source: Returns the result of recomputing the view’s body with the provided animation.
ja: ビューのもつボディをこの提供されたアニメーションで再計算する結果を返します。

source: Returns the result of the reverse transformation of a given value.
ja: 与えられた値の逆変換の結果を返します。

source: Returns the result of transforming a given value.
ja: 与えられた値の変換の結果を返します。

source: Returns the root element of the receiver.
ja: レシーバのルート要素を返します。

source: Returns the string encoding for the given data as detected by attempting to create a string according to the specified encoding options.
ja: 与えられたデータに対する文字列符号化を返します、指定された符号化オプションによって文字列を作成することを試みることによって検出されるとおりに。

source: Returns the string representation of the receiver as it would appear in an XML document, with one or more output options specified.
ja: レシーバの文字列表現を返します、それがXML書類において現れるのと同じに、１つ以上の指定された出力オプションで。

source: Returns the string representation of the receiver as it would appear in an XML document.
ja: レシーバの文字列表現を返します、それがXML書類において現れるのと同じに。

source: Returns the system identifier associated with the receiver.
ja: レシーバと結び付けられたシステム識別子を返します。

source: Returns the value of the component corresponding to the specified key.
ja: 指定されたキーに対応している構成要素の値を返します。

source: Returns the value transformer identified by a given identifier.
ja: 与えられた識別子によって識別される値変換子を返します。

source: Returns true if the path contains a specified point.
ja: パスがある指定された点を含むならばtrueを返します。

source: Returns whether the receiver is still running.
ja: レシーバがまだ実行中かどうかを返します。

source: Returns which platform to run the provider on.
ja: どのプラットホーム上でプロバイダが動くことになるかを返します。

source: Revert to Saved
ja: バージョンを戻す

source: Review symbols that are no longer supported, and find the replacements to use instead.
ja: もはやサポートされないシンボルを吟味します、そして代わりに使う代用品を見つけます。

source: Review unsupported symbols and their replacements.
ja: サポートされないシンボルとそれらの代替物をレビューします。

source: Rotates this shape around an anchor point at the angle you specify.
ja: この形状をアンカーポイントを中心にあなたが指定する角度で回転します。

source: Rotates this view’s rendered output around the specified point.
ja: このビューのもつ描画された出力をこの指定された点を中心として回転します。

source: Rotates this view’s rendered output in three dimensions around the given axis of rotation.
ja: このビューのもつ描画された出力を３次元においてこの指定された回転軸を中心として回転します。

source: Rotating and Transforming Views
ja: ビューを回転するおよび変形する

source: Running and Stopping a Task
ja: タスクの実行と停止

source: Save
ja: 保存

source: Save As/Duplicate
ja: 別名で保存／複製

source: Scale
ja: 規準

source: Scales images within the view according to one of the relative sizes available including small, medium, and large images sizes.
ja: ビュー内部の画像それらの拡大縮小を、小、中、そして大の画像サイズを含む利用可能な相対的サイズの１つによって行います。

source: Scales the view to fill its parent.
ja: ビューを拡大縮小してそれの親をいっぱいに満たします。

source: Scales the view to fit its parent.
ja: ビューを縮尺変更してそれの親にぴったり合わせます。

source: Scales this shape without changing its bounding frame.
ja: この形状をそれの境界フレームを変更することなく拡大縮小します。

source: Scales this view to fill its parent.
ja: このビューを拡大縮小して、それの親いっぱいに満たします。

source: Scales this view to fit its parent.
ja: このビューを拡大縮小してそれの親にぴったり合わせます。

source: Scales this view’s rendered output by the given amount in both the horizontal and vertical directions, relative to an anchor point.
ja: このビューのもつ描出された出力をこの与えられた量によって水平と垂直方向の両方で、あるアンカーポイントに関して、拡大縮小します。

source: Scales this view’s rendered output by the given horizontal and vertical amounts, relative to an anchor point.
ja: このビューのもつ描出された出力をこの与えられた水平と垂直の量によって、あるアンカーポイントに関して、拡大縮小します。

source: Scales this view’s rendered output by the given vertical and horizontal size amounts, relative to an anchor point.
ja: このビューのもつ描出された出力を拡大縮小します、この与えられた水平と垂直の大きさ量によって、あるアンカーポイントに相対して。

source: Scaling Views
ja: ビューを拡大縮小する

source: Scanning Characters and Strings
ja: 文字と文字列を走査する

source: Scanning Numeric Values
ja: 数値を走査する

source: Scans a given string, returning an equivalent string object by reference if a match is found.
ja: 与えられた文字列を求めて走査します、もしある合致が見つけられるならば、同等の文字列オブジェクトを参照によって返します。

source: Scans for a double value from a hexadecimal representation, returning a found value by reference.
ja: ある16進法表現からdouble値を走査します、見つかった値を参照によって返します。

source: Scans for a double value, returning a found value by reference.
ja: double値を走査します、見つかった値を参照によって返します。

source: Scans for a float value, returning a found value by reference.
ja: float値を走査します、見つかった値を参照によって返します。

source: Scans for a long long value from a decimal representation, returning a found value by reference.
ja: ある10進数表現からlong long値を走査します、見つかった値を参照によって返します。

source: Scans for a long long value from a hexadecimal representation, returning a found value by reference.
ja: ある16進数表現からlong long値を走査します、見つかった値を参照によって返します。

source: Scans for an NSDecimal value, returning a found value by reference.
ja: NSDecimal値を走査します、見つかった値を参照によって返します。

source: Scans for an NSInteger value from a decimal representation, returning a found value by reference
ja: ある10進表現からNSInteger値を走査します、見つかった値を参照によって返します。

source: Scans for an int value from a decimal representation, returning a found value by reference.
ja: ある10進表現からint値を走査します、見つかった値を参照によって返します。

source: Scans for an unsigned long long value from a decimal representation, returning a found value by reference.
ja: ある10進数表現から符号なしlong long値を走査します、見つかった値を参照によって返します。

source: Scans for an unsigned value from a hexadecimal representation, returning a found value by reference.
ja: ある16進数表現から符号なし値を走査します、見つかった値を参照によって返します。

source: Scans the string as long as characters from a given character set are encountered, accumulating characters into a string that’s returned by reference.
ja: ある与えられた文字集合からの文字それらが出くわされるかぎりは文字列を走査します、参照によって返されるある文字列へと文字それらを集積しています。

source: Scans the string until a character from a given character set is encountered, accumulating characters into a string that’s returned by reference.
ja: ある与えられた文字集合からのある文字が出くわされるまでこの文字列を走査します、参照によって返されるある文字列へと文字それらを集積しています。

source: Scans the string until a given string is encountered, accumulating characters into a string that’s returned by reference.
ja: ある与えられた文字が出くわされるまでこの文字列を走査します、参照によって返されるある文字列へと文字それらを集積しています。

source: Scenes contain the view hierarchies that define the user interface of your app, and have a life cycle that the system manages.
ja: シーンはビュー階層を含みます、それは、あなたのアプリのユーザインターフェイスを定義します、そしてシステムが管理するライフサイクルを持ちます。

source: See Using Collection Operators for more information.
ja: Using Collection Operatorsをさらなる情報のために見てください。

source: See Text for more information about localizing strings.
ja: Textを文字列のローカライズについてのさらなる情報として見てください。

source: See helpAnchor for more information.
ja: helpAnchorをさらなる情報として見てください。

source: See Daemons and Services Programming Guide and XPC for more information.
ja: Daemons and Services Programming GuideとXPCをさらなる情報として見てください。

source: See Also
ja: 参照

source: See Also: CFBundleTypeRole with a value of “Viewer”
ja: 次も見てください：“Viewer” の値をもつCFBundleTypeRole。

source: See Ending an NSTask for an example.
ja: Ending an NSTask を例として見てください。

source: See the related programming topic for more information.
ja: 関連プログラミングトピックをさらなる情報のために見てください。

source: Select All
ja: すべてを選択

source: Sends a terminate signal to the receiver and all of its subtasks.
ja: 終止信号をレシーバとそれの下位タスクの全てに送ります。

source: Sends an interrupt signal to the receiver and all of its subtasks.
ja: 割り込み信号をレシーバとそれの下位タスクの全てに送ります。

source: Sequence One Gesture After Another
ja: １つのジェスチャを他のものの後に配列する

source: Sequences a gesture with another one to create a new gesture, which results in the second gesture only receiving events after the first gesture succeeds.
ja: あるジェスチャを別のものと順番に並べて、新しいジェスチャを作成します、それは最初のジェスチャが成功した後にイベントを受け取る場合にのみ２番目のジェスチャという結果になります。

source: Sequences this gesture with another, such that the other gesture does not receive any events until this gesture succeeds.
ja: このジェスチャを別のものと一定の順番に並べます、たとえば他のジェスチャがどんなイベントもこのジェスチャがうまくいくまでは受け取らないというように。

source: Sequences this gesture with another, such that the other gesture doesn’t receive any events until this gesture succeeds.
ja: このジェスチャを別のものと一定の順番に並べます、たとえば他のジェスチャがどんなイベントもこのジェスチャがうまくいくまでは受け取らないというように。

source: Set A is a strict subset of another set B if every member of A is also a member of B and B contains at least one element that is not a member of A.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバであり、Bが少なくとも１つのAのメンバではない要素を含む場合です。

source: Set A is a strict superset of another set B if every member of B is also a member of A and A contains at least one element that is not a member of B.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバであり、Aが少なくとも１つのBのメンバではない要素を含む場合です。

source: Set A is a subset of another set B if every member of A is also a member of B.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバである場合です。

source: Set A is a superset of another set B if every member of B is also a member of A.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバである場合です。

source: Set style preferences and other environment data.
ja: スタイル優先および他の環境データを設定します。

source: Set the root element of the receiver.
ja: レシーバのルート要素を設定します。

source: Set to true to create an opaque blur, or set to false to permit transparency.
ja: trueに設定して不透明ぼかしを作成してください、またはfalseに設定して透明度を許可してください。

source: Sets a Boolean value that specifies whether the receiver represents a standalone XML document.
ja: レシーバがスタンドアローンXML文書を表すかどうかを指定するブール値を設定します。

source: Sets a callback to return a value for the given preference key when accessed by ancestors.
ja: 祖先によってアクセスされた時にこの与えられたプレファレンスキーに対して返すコールバックを設定します。

source: Sets a clipping shape for the view.
ja: ある切り抜き形状をビューに設定します。

source: Sets a clipping shape for this view.
ja: このビューに対する切り抜き形状を設定します。

source: Sets a selection identifier for this view’s accessibility element.
ja: セレクション識別子をこのビューのもつアクセシビリティ要素に対して設定します。

source: Sets a tag for the view in order to differentiate it from a list of view options.
ja: ビューに対してタグを設定します、それをビューオプションのリストから区別するために。

source: Sets a transform for the case of the text contained in this view when displayed.
ja: 表示される時にこのビューの中に含まれるテキストのケースに対してある変換を設定します。

source: Sets a user-visible string identifying the view’s functionality.
ja: ビューのもつ機能性を識別するユーザ可視の文字列を設定します。

source: Sets a user-visible string that identifies the view’s functionality.
ja: ビューのもつ機能性を識別するユーザ可視の文字列を設定します。

source: Sets a value to return for the given preference key when accessed by ancestors.
ja: 祖先によってアクセスされた時にこの与えられたプレファレンスキーに対して返す値を設定します。

source: Sets a view behind the view when placed in a list.
ja: リスト内に置かれた時にビューを後ろに設定します。

source: Sets all attributes of the receiver at once, replacing any existing attribute nodes.
ja: レシーバの全ての属性を一度に設定します、あらゆる既存の属性ノードを置き換えます。

source: Sets all child nodes of the receiver at once, replacing any existing children.
ja: レシーバの全ての子ノードを一度に設定します、あらゆる既存の子を置き換えます。

source: Sets all of the namespace nodes of the receiver at once, replacing any existing namespace nodes.
ja: レシーバの全ての名前空間ノードを一度に設定します、あらゆる既存の名前空間ノードを置き換えます。

source: Sets alternate input labels with which users identify a view.
ja: それでユーザがあるビューを識別するところの代替の入力ラベルを設定します。

source: Sets principal views that have special significance to this Touch Bar.
ja: 特別な意義を持つプリンシパル（主役）ビューを、このTouch Barに対して設定します。

source: Sets the Touch Bar content to be shown in the Touch Bar when applicable.
ja: Touch Bar内容を設定します、適用可能な時にTouch Barにおいて示されます。

source: Sets the accent color for the view and the views it contains.
ja: アクセントカラーをそのビューとそれが含むビューそれらに対して設定します。

source: Sets the accent color for this view and the views it contains.
ja: アクセントカラー（強調色）をこのビューおよびそれが含むビューそれらに対して設定します。

source: Sets the alignment of multiline text in this view.
ja: 複数行テキストの整列をこのビューにおいて設定します。

source: Sets the amount of space between lines of text in the view.
ja: ビューの中のテキストの行間の空間の量を設定します。

source: Sets the amount of space between lines of text in this view.
ja: このビューの中のテキストの行の間の開きの量を設定します。

source: Sets the attributes of the receiver based on the key-value pairs specified in the passed dictionary.
ja: レシーバの属性を設定します、渡された辞書において指定されたキー値ペアに基づきます。

source: Sets the attributes of the receiver based on the key-value pairs specified in the passed-in dictionary.
ja: レシーバの属性を設定します、渡された辞書において指定されたキー値ペアに基づきます。

source: Sets the behavior of the user-customized view.
ja: ユーザがカスタマイズするビューの挙動を設定します。

source: Sets the behavior of the view when being customized by the user.
ja: ビューの挙動を設定します、ユーザによってカスタマイズされている時に。

source: Sets the blend mode for compositing the view with overlapping views.
ja: 混合モードを、重なり合っているビューをもつビューの合成に対して設定します。

source: Sets the blend mode for compositing this view with overlapping views.
ja: このビューを重なり合っているビューそれらと合成することに対するブレンドモード（混合方式）を設定します。

source: Sets the character encoding of the receiver to encoding,
ja: レシーバの文字エンコーディングをencodingに設定します。

source: Sets the child nodes of the receiver.
ja: レシーバの子ノードを設定します。

source: Sets the color of the foreground elements displayed by this view.
ja: このビューによって表示される前景要素の色を設定します。

source: Sets the color of the text displayed by this view.
ja: このビューによって表示されるテキストの色を設定します。

source: Sets the color that the view uses for foreground elements.
ja: 色を設定します、それはビューが前面要素に使います。

source: Sets the color to apply to the system cell platter of the view when placed in a list.
ja: リスト内に置かれた時にビューのシステムセルプラッタに適用される色を設定します。

source: Sets the command arguments that should be used to launch the executable.
ja: その実行可能ファイルを起動するのに使われるべきコマンド引数を設定します。

source: Sets the content of the receiver as a string value and, optionally, resolves character references, predefined entities, and user-defined entities as declared in the associated DTD.
ja: レシーバの内容を文字列値として設定しますそして、随意に文字参照、あらかじめ定義されたエンティティ、そしてユーザ定義エンティティをその結びつけられたDTDにおいて宣言されるとおりに解決します。

source: Sets the content that the Touch Bar displays.
ja: Touch Barが表示する内容を設定します。

source: Sets the contrast and separation between similar colors in the view.
ja: ビューの中の類似した色の間のコントラストと分解を設定します。

source: Sets the contrast and separation between similar colors in this view.
ja: このビューにおいて同系色の間のコントラストと分離を設定します。

source: Sets the current directory for the receiver.
ja: レシーバに対する現在のディレクトリを設定します。

source: Sets the default font for text in the view.
ja: 省略時のフォントをビューの中のテキストに対して設定します。

source: Sets the default font for text in this view.
ja: 省略時のフォントをこのビューの中のテキストに対して設定します。

source: Sets the default wheel-style picker item height.
ja: 省略時の環形式ピッカー項目の高さを設定します。

source: Sets the deletion action for the dynamic view.
ja: 動的ビューに対する削除アクションを設定します。

source: Sets the environment for the receiver.
ja: レシーバに対する環境を設定します。

source: Sets the environment value indicated by a key path to the given value.
ja: あるキーパスによって指し示された環境値をこの与えられた値へと設定します。

source: Sets the font weight of the text.
ja: テキストのフォントウェイトを設定します。

source: Sets the insert action for the dynamic view.
ja: 動的ビューに対して挿入アクションを設定します。

source: Sets the inset to be applied to the view when placed in a list.
ja: リスト内に置かれた時にビューに適用されることになるインセットを設定します。

source: Sets the keyboard type for this view.
ja: キーボード型をこのビューに対して設定します。

source: Sets the kind of output content for the receiver.
ja: 出力内容の種類をレシーバに対して設定します。

source: Sets the maximum number of lines that text can occupy in the view.
ja: テキストがビューにおいて占めることができる最大の行数を設定します。

source: Sets the maximum number of lines that text can occupy in this view.
ja: 最大限の行数を設定します、それはテキストがこのビューにおいて占めることができるものです。

source: Sets the minimum amount that text in this view scales down to fit in the available space.
ja: このビューの中のテキストがその利用可能な空間に収まるよう縮尺を下げる最小限度量を設定します。

source: Sets the minimum amount that text scales down to fit the available space.
ja: テキストがその理由可能な空間に合うように縮小する最小限の量を設定します。

source: Sets the move action for the dynamic view.
ja: 動的ビューに対する移動アクションを設定します。

source: Sets the navigation bar items for this view.
ja: ナビゲーションバー項目をこのビューに対して設定します。

source: Sets the preferred color scheme for this view.
ja: 優先カラースキームをこのビューに対して設定します。

source: Sets the priority by which a parent layout should apportion space to the child.
ja: それによって親レイアウトが空間を子に配分すべきところの優先度を設定します。

source: Sets the priority by which a parent layout should apportion space to this child.
ja: それによって親レイアウトがこの子に対して空間を割り当てるべき優先事項を設定します。

source: Sets the receiver’s executable.
ja: レシーバのもつ実行可能ファイルを設定します。

source: Sets the scale of images inside the view.
ja: ビュー内の画像の縮尺を設定します。

source: Sets the size class, like regular or small, for controls within this view.
ja: 大きさの種類を、標準または小型のように、このビュー内のコントロールに対して設定します。

source: Sets the sort priority order for this view’s accessibility element, relative to other elements at the same level.
ja: このビューのもつアクセシビリティ要素に対してソート優先順位を設定します、同じ水準での他の要素に相対して。

source: Sets the spacing, or kerning, between characters.
ja: 空き、またはカーニング、を文字間に設定します。

source: Sets the standard error for the receiver.
ja: レシーバに対する標準エラーを設定します。

source: Sets the standard input for the receiver.
ja: レシーバに対する標準入力を設定します。

source: Sets the standard output for the receiver.
ja: レシーバに対する標準出力を設定します。

source: Sets the style for buttons within this view to a button style with a custom appearance and custom interaction behavior.
ja: このビュー内のボタンに対するスタイルを、あつらえの外観とあつらえの相互作用挙動をもつボタンスタイルへと設定します。

source: Sets the style for buttons within this view to a button style with a custom appearance and standard interaction behavior.
ja: このビュー内のボタンに対するスタイルを、あつらえの外観と標準相互作用挙動をもつボタンスタイルへと設定します。

source: Sets the style for buttons within this view.
ja: このビュー内のボタンそれらに対してスタイルを設定します。

source: Sets the style for date pickers within this view.
ja: このビュー内の日付ピッカーそれらに対してスタイルを設定します。

source: Sets the style for lists within this view.
ja: このビュー内のリストそれらに対してスタイルを設定します。

source: Sets the style for menu buttons within this view.
ja: このビュー内のメニューボタンそれらに対してスタイルを設定します。

source: Sets the style for navigation views within this view.
ja: このビュー内のナビゲーションビューそれらに対してスタイルを設定します。

source: Sets the style for pickers within this view.
ja: このビュー内のピッカーそれらに対してスタイルを設定します。

source: Sets the style for radio group style pickers within the view’s environment to be radio buttons horizontally arranged inside of the layout.
ja: ラジオグループ形式ピッカーに対するスタイルをビューのもつ環境内で設定します、ラジオボタンが水平にそのレイアウト（割り付け）の内側で整頓されるようにします。

source: Sets the style for text fields within this view.
ja: このビュー内のテキストフィールドそれらに対してスタイルを設定します。

source: Sets the style for the tab view within the the current environment.
ja: スタイルをタブビューに対する現在の環境内で設定します。

source: Sets the style for toggles within this view.
ja: このビュー内のトグルそれらに対してスタイルを設定します。

source: Sets the tab bar item associated with this view.
ja: このビューと結びつけられたタブバー項目を設定します。

source: Sets the text content type for this view, which the system uses to offer suggestions while the user enters text on a watchOS device.
ja: テキスト内容型をこのビューに対して設定します、それはシステムが提案を申し出るために使います、ユーザがテキストをwatchOSデバイス上で入力する間に。

source: Sets the text content type for this view, which the system uses to offer suggestions while the user enters text on an iOS or tvOS device.
ja: テキスト内容型をこのビューに対して設定します、それはシステムが提案を申し出るために使います、ユーザがテキストをiOSまたはtvOSデバイス上で入力する間に。

source: Sets the text content type for this view, which the system uses to offer suggestions while the user enters text on macOS.
ja: テキスト内容型をこのビューに対して設定します、それはシステムが提案を申し出るために使います、ユーザがテキストをmacOS上で入力する間に。

source: Sets the title and display mode in the navigation bar for this view.
ja: このビューに対するナビゲーションバーにおけるタイトルと表示モードを設定します。

source: Sets the title in the navigation bar for this view.
ja: このビューのナビゲーションバーにおけるタイトルを設定します。

source: Sets the title of this view’s navigation bar with a localized string.
ja: このビューのもつナビゲーションバーのタイトルをあるローカライズされた文字列で設定します。

source: Sets the title of this view’s navigation bar with a string.
ja: このビューのもつナビゲーションバーのタイトルをある文字列で設定します。

source: Sets the touch bar and its content to be shown in the Touch Bar when applicable.
ja: タッチバーを設定してそれの内容をTouch Barにおいて表示されるようにします、適用可能な時に。

source: Sets the tracking for the text.
ja: トラッキングをテキストに設定します。

source: Sets the transparency of the view.
ja: ビューの透明度を設定します。

source: Sets the transparency of this view.
ja: このビューの透明度を設定します。

source: Sets the truncation mode for lines of text that are too long to fit in the available space.
ja: 利用可能な空間に収まるには長すぎるテキストの行に対する切り詰めモードを設定します。

source: Sets the version of the receiver’s XML.
ja: レシーバの持つXMLのバージョンを設定します。

source: Sets the vertical offset for the text relative to its baseline.
ja: 垂直オフセットをテキストにそれのベースラインに相対して設定します。

source: Sets the view as having special significance to the TouchBar.
ja: 特別な意味をTouchBarに持つようにビューを設定します。

source: Sets the view’s color scheme.
ja: ビューのもつカラースキームを設定します。

source: Sets the view’s horizontal alignment.
ja: ビューのもつ水平整列を設定します。

source: Sets the view’s vertical alignment.
ja: ビューのもつ垂直整列を設定します。

source: Sets the visibility of the status bar for the view.
ja: ビューに対してステータスバーの可視性を設定します。

source: Sets the visibility of the status bar.
ja: ステータスバーの可視性を設定します。

source: Sets the weight of the font.
ja: フォントのウェイトを設定します。

source: Sets up an action that triggers in response to receiving the exit command while the view has focus.
ja: ビューがフォーカスを持つ間に退出命令を受け取ることに答えて引き起こされるアクションを準備します。

source: Sets whether text can compress the space between characters when necessary to fit text in a line.
ja: テキストを１行に収めるために必要な場合に、テキストが文字の間の空間を圧縮できるかどうかを設定します。

source: Sets whether text in this view can compress the space between characters when necessary to fit text in a line.
ja: このビューの中のテキストが文字間の空きを圧縮することが、テキストを一行に収める必要な時に可能かどうかを設定します。

source: Sets whether the view flips its contents horizontally when the layout direction is right-to-left.
ja: ビューがそれの内容を水平にフリップするかどうかを設定します、レイアウト方向が右から左である場合に。

source: Sets whether this view flips its contents horizontally when the layout direction is right-to-left.
ja: レイアウト方向が右から左の時に、このビューがそれの内容を水平にフリップするかどうかを設定します。

source: Sets whether this view should ignore the system Smart Invert setting.
ja: このビューがシステムのSmart Invert設定を無視すべきかどうかを設定します。

source: Sets whether to apply auto-capitalization to this view.
ja: 自動キャピタライゼーションをこのビューに適用すべきかどうかを設定します。

source: Sets whether to disable autocorrection for this view.
ja: 自動修正をこのビューに対して無効にするべきかどうかを設定します。

source: Setting Commands
ja: コマンドを設定する

source: Setting View Colors
ja: ビューカラーを設定する

source: Setting View Environment Values
ja: ビュー環境値を設定する

source: Setting View Preferences
ja: ビュー環境設定を設定する

source: Setting a Title Display Mode
ja: タイトル表示モードを設定する

source: Setting the Border of a View
ja: ビューの境界線を設定する

source: Setting the Environment Values of a View
ja: ビューの環境値を設定する

source: Setting the Position of a View
ja: ビューの位置を設定する

source: Setting the Stroke Characteristics
ja: 筆致特徴を設定する

source: Setting the Type
ja: 型を設定する

source: Setting the object value or string value of an XMLDTDNode objects affects different parts of different kinds of declaration.
ja: あるXMLDTDNodeオブジェクトのオブジェクト値または文字列値を設定することは、宣言の異なる種類の宣言の異なる部分に影響します。

source: Setting the title’s displaymode to .inline places the navigation bar title within the bounds of the navigation bar.
ja: タイトルのもつdisplaymodeを.inlineに設定することは、ナビゲーションバータイトルをナビゲーションバーの境界内に設置します。

source: Shape Implementations
ja: Shape実装

source: Shapes without an explicit fill or stroke get a default fill based on the foreground color.
ja: 明示的な塗りや輪郭線のない形状は、前景色に基づく省略時の塗りを得ます。

source: Share code between apps on multiple platforms with views and controls that adapt to their context and presentation.
ja: コードを複数のプラットホーム上のアプリそれらの間で共有してください、それらの文脈および提示に合わせて変化するビューとコントロールとともに。

source: Showing the contents puts the disclosure group into the “expanded” state, and hiding them makes the disclosure group “collapsed”.
ja: 内容を表示することは、開示グループを “展開された” 状態に置きます、そしてそれらを隠すことは、開示グループを “折りたたまれる” ようにします。

source: Similarly, an app that lacks any localization information displays “pencil” in any locale.
ja: 同様に、あらゆるローカライゼーション情報を欠いているアプリは、“pencil” をどんなロケールにおいても表示します。

source: Similarly, to create a context menu item that triggers an action, add a button to the menu’s content:
ja: 同様に、ある動作の引き金となるコンテキストメニュー項目を作成するには、あるボタンをそのメニューのもつ内容に加えてください：

source: Size Classes
ja: サイズクラス

source: Sizing a View
ja: ビューをある大きさに作る

source: Some styles of controls use the accent color as a default tint color.
ja: コントロールのスタイルのいくつかは、アクセントカラーを省略時の淡彩（ティントカラー）として使います。

source: Spacers and Dividers
ja: 間隔子と分割子

source: Special Considerations
ja: 特別な注意事項
